Repository: FyrbyAdditive/FyxLocal
Catalog: Sources/FyxLocalApp/Resources/Localizable.xcstrings
Source language: en
Languages: da, es, nb, sv

source: Search the public web via DuckDuckGo. No API key required.
da: Søg på det offentlige web via DuckDuckGo. Ingen API-nøgle kræves.
es: Busca en la web pública a través de DuckDuckGo. No se requiere clave de API.
nb: Søk på det åpne nettet via DuckDuckGo. Ingen API-nøkkel kreves.
sv: Sök det publika webben via DuckDuckGo. Ingen API-nyckel krävs.

source: Search titles
da: Søg i titler
es: Buscar títulos
nb: Søk i titler
sv: Sök titlar

source: Select a document
da: Vælg et dokument
es: Selecciona un documento
nb: Velg et dokument
sv: Välj ett dokument

source: Select all
da: Markér alle
es: Seleccionar todo
nb: Velg alle
sv: Markera alla

source: Select none
da: Fravælg alle
es: No seleccionar ninguno
nb: Velg ingen
sv: Avmarkera alla

source: Select or create a collection
da: Vælg eller opret en samling
es: Selecciona o crea una colección
nb: Velg eller opprett en samling
sv: Välj eller skapa en samling

source: Select or start a conversation
da: Vælg eller start en samtale
es: Selecciona o inicia una conversación
nb: Velg eller start en samtale
sv: Välj eller starta en konversation

source: Server max unknown — defaults to a safe 8,192 until you Test connection.
da: Servermaks ukendt — bruger sikre 8.192, indtil du Tester forbindelse.
es: Máximo del servidor desconocido — se usa un valor seguro predeterminado de 8192 hasta que pruebes la conexión.
nb: Serverens maks er ukjent — bruker trygge 8 192 til du kjører Test tilkobling.
sv: Servermax okänt — använder säkra 8 192 tills du Testar anslutningen.

source: Settings
da: Indstillinger
es: Ajustes
nb: Innstillinger
sv: Inställningar

source: Showing FyxLocal's built-in preamble. Edit to override.
da: Viser FyxLocals indbyggede indledning. Redigér for at tilsidesætte.
es: Mostrando el preámbulo integrado de FyxLocal. Edítalo para reemplazarlo.
nb: Viser FyxLocals innebygde innledning. Rediger for å overstyre.
sv: Visar FyxLocals inbyggda inledning. Redigera för att åsidosätta.

source: Sign in
da: Log ind
es: Iniciar sesión
nb: Logg på
sv: Logga in

source: Sign out
da: Log ud
es: Cerrar sesión
nb: Logg av
sv: Logga ut

source: Skills
da: Færdigheder
es: Habilidades
nb: Ferdigheter
sv: Färdigheter

source: Skills are folders of instructions and scripts the model can use. Imported skills run in a sandbox with no network access. Enable a skill per-chat in the Inspector, or mark it as applying to every chat below.
da: Færdigheder er mapper med instruktioner og scripts, som modellen kan bruge. Importerede færdigheder kører i en sandkasse uden netværksadgang. Aktivér en færdighed pr. chat i Inspektøren, eller markér, at den gælder for alle chats nedenfor.
es: Las habilidades son carpetas de instrucciones y scripts que el modelo puede usar. Las habilidades importadas se ejecutan en un sandbox sin acceso a la red. Activa una habilidad por chat en el Inspector, o márcala abajo para que se aplique a todos los chats.
nb: Ferdigheter er mapper med instruksjoner og skript modellen kan bruke. Importerte ferdigheter kjører i en sandkasse uten nettverkstilgang. Aktiver en ferdighet per chat i Inspektøren, eller merk den som gjeldende for alle chatter nedenfor.
sv: Färdigheter är mappar med instruktioner och skript som modellen kan använda. Importerade färdigheter körs i en sandlåda utan nätverksåtkomst. Aktivera en färdighet per chatt i inspektören, eller markera att den gäller alla chattar nedan.

source: Skills available in this chat
da: Færdigheder tilgængelige i denne chat
es: Habilidades disponibles en este chat
nb: Ferdigheter tilgjengelige i denne chatten
sv: Färdigheter tillgängliga i den här chatten

source: Source
da: Kilde
es: Origen
nb: Kilde
sv: Källa

source: Source code
da: Kildekode
es: Código fuente
nb: Kildekode
sv: Källkod

source: Start a conversation
da: Start en samtale
es: Inicia una conversación
nb: Start en samtale
sv: Starta en konversation

source: Stdio (subprocess)
da: Stdio (underproces)
es: Stdio (subproceso)
nb: Stdio (underprosess)
sv: Stdio (delprocess)

source: Stop sequences
da: Stopsekvenser
es: Secuencias de parada
nb: Stoppsekvenser
sv: Stoppsekvenser

source: Temperature
da: Temperatur
es: Temperatura
nb: Temperatur
sv: Temperatur

source: Test connection / fetch models
da: Test forbindelse / hent modeller
es: Probar conexión / obtener modelos
nb: Test tilkobling / hent modeller
sv: Testa anslutning / hämta modeller

source: Test connection / refresh tools
da: Test forbindelse / opdatér værktøjer
es: Probar conexión / actualizar herramientas
nb: Test tilkobling / oppdater verktøy
sv: Testa anslutning / uppdatera verktyg

source: Text length is out of bounds.
da: Tekstlængden er uden for grænserne.
es: La longitud del texto está fuera de los límites.
nb: Tekstlengden er utenfor grensene.
sv: Textlängden är utanför gränserna.

source: The assistant proposed this change. It will only happen if you confirm.
da: Assistenten foreslog denne ændring. Den sker kun, hvis du bekræfter.
es: El asistente propuso este cambio. Solo se aplicará si lo confirmas.
nb: Assistenten foreslo denne endringen. Den skjer bare hvis du bekrefter.
sv: Assistenten föreslog den här ändringen. Den sker bara om du bekräftar.

source: These conversations will be removed permanently. This cannot be undone.
da: Disse samtaler fjernes permanent. Dette kan ikke fortrydes.
es: Estas conversaciones se eliminarán de forma permanente. Esta acción no se puede deshacer.
nb: Disse samtalene fjernes permanent. Dette kan ikke angres.
sv: Dessa konversationer tas bort permanent. Detta kan inte ångras.

source: Thinking
da: Tænker
es: Pensando
nb: Tenker
sv: Tänker

source: This agent isn't used by any chat.
da: Denne agent bruges ikke af nogen chat.
es: Ningún chat usa este agente.
nb: Denne agenten brukes ikke av noen chat.
sv: Denna agent används inte av någon chatt.

source: This conversation will be removed permanently. This cannot be undone.
da: Denne samtale fjernes permanent. Dette kan ikke fortrydes.
es: Esta conversación se eliminará de forma permanente. Esta acción no se puede deshacer.
nb: Denne samtalen fjernes permanent. Dette kan ikke angres.
sv: Denna konversation tas bort permanent. Detta kan inte ångras.

source: This field is required.
da: Dette felt er påkrævet.
es: Este campo es obligatorio.
nb: Dette feltet er obligatorisk.
sv: Det här fältet är obligatoriskt.

source: This model accepts images
da: Denne model accepterer billeder
es: Este modelo acepta imágenes
nb: Denne modellen godtar bilder
sv: Den här modellen tar emot bilder

source: This model doesn't accept images. Enable image input for it in Settings → Providers.
da: Denne model accepterer ikke billeder. Aktivér billedinput for den i Indstillinger → Udbydere.
es: Este modelo no acepta imágenes. Activa la entrada de imágenes para él en Ajustes → Proveedores.
nb: Denne modellen godtar ikke bilder. Aktiver bildeinndata for den i Innstillinger → Leverandører.
sv: Den här modellen tar inte emot bilder. Aktivera bildindata för den i Inställningar → Leverantörer.

source: This picks the agent any newly-created chat starts with. Individual chats can override in the Inspector.
da: Dette vælger den agent, som enhver nyoprettet chat starter med. Enkelte chats kan tilsidesætte den i Inspektøren.
es: Esto elige el agente con el que empieza cada chat recién creado. Cada chat puede anularlo en el Inspector.
nb: Dette velger agenten enhver nyopprettet chat starter med. Enkeltchatter kan overstyre i Inspektøren.
sv: Detta väljer agenten som varje ny chatt börjar med. Enskilda chattar kan åsidosätta i Inspektören.

source: This removes %lld later message(s) from the conversation.
da: Dette fjerner %lld senere besked(er) fra samtalen.
es: Esto elimina %lld mensaje(s) posterior(es) de la conversación.
nb: Dette fjerner %lld senere melding(er) fra samtalen.
sv: Detta tar bort %lld senare meddelande(n) från konversationen.

source: This resource type can't be attached.
da: Denne ressourcetype kan ikke vedhæftes.
es: Este tipo de recurso no se puede adjuntar.
nb: Denne ressurstypen kan ikke legges ved.
sv: Den här resurstypen kan inte bifogas.

source: This skill isn't enabled in any chat.
da: Denne færdighed er ikke aktiveret i nogen chat.
es: Esta habilidad no está activada en ningún chat.
nb: Denne ferdigheten er ikke aktivert i noen chat.
sv: Den här färdigheten är inte aktiverad i någon chatt.

source: Title
da: Titel
es: Título
nb: Tittel
sv: Titel

source: Tool result
da: Værktøjsresultat
es: Resultado de la herramienta
nb: Verktøyresultat
sv: Verktygsresultat

source: Tool result (error)
da: Værktøjsresultat (fejl)
es: Resultado de la herramienta (error)
nb: Verktøyresultat (feil)
sv: Verktygsresultat (fel)

source: Tools
da: Værktøjer
es: Herramientas
nb: Verktøy
sv: Verktyg

source: Type below to begin.
da: Skriv nedenfor for at begynde.
es: Escribe abajo para empezar.
nb: Skriv nedenfor for å begynne.
sv: Skriv nedan för att börja.

source: URL (e.g. https://host/mcp)
da: URL (f.eks. https://vært/mcp)
es: URL (p. ej., https://host/mcp)
nb: URL (f.eks. https://host/mcp)
sv: URL (t.ex. https://värd/mcp)

source: Untitled agent
da: Agent uden navn
es: Agente sin título
nb: Agent uten navn
sv: Namnlös agent

source: Untitled server
da: Server uden navn
es: Servidor sin título
nb: Server uten navn
sv: Namnlös server

source: Updated
da: Opdateret
es: Actualizado
nb: Oppdatert
sv: Uppdaterad

source: Upgrading document search
da: Opgraderer dokumentsøgning
es: Actualizando la búsqueda de documentos
nb: Oppgraderer dokumentsøk
sv: Uppgraderar dokumentsökning

source: Use
da: Brug
es: Usar
nb: Bruk
sv: Använd

source: Use OAuth
da: Brug OAuth
es: Usar OAuth
nb: Bruk OAuth
sv: Använd OAuth

source: Used for every chat that talks to this provider.
da: Bruges til hver chat, der taler med denne udbyder.
es: Se usa en todos los chats que se comunican con este proveedor.
nb: Brukes for hver chat som snakker med denne leverandøren.
sv: Används för varje chatt som pratar med denna leverantör.

source: Using server max: %@ tokens.
da: Bruger servermaks: %@ tokens.
es: Usando el máximo del servidor: %@ tokens.
nb: Bruker serverens maks: %@ tokener.
sv: Använder servermax: %@ tokens.

source: Utilities
da: Værktøjer
es: Utilidades
nb: Verktøy og hjelpemidler
sv: Verktyg

source: Value is out of range.
da: Værdien er uden for intervallet.
es: El valor está fuera de rango.
nb: Verdien er utenfor området.
sv: Värdet är utanför intervallet.

source: Web fetch
da: Hent side
es: Obtención web
nb: Netthenting
sv: Hämta sida

source: Web fetch uses WKWebView + Mozilla Readability for clean extraction.
da: Hent side bruger WKWebView + Mozilla Readability til ren udtrækning.
es: La obtención web usa WKWebView + Mozilla Readability para una extracción limpia.
nb: Netthenting bruker WKWebView + Mozilla Readability for ren tekstuthenting.
sv: Hämta sida använder WKWebView + Mozilla Readability för ren extraktion.

source: Web search
da: Websøgning
es: Búsqueda web
nb: Nettsøk
sv: Webbsökning

source: Web search uses DuckDuckGo with no API key.
da: Websøgning bruger DuckDuckGo uden API-nøgle.
es: La búsqueda web usa DuckDuckGo sin clave de API.
nb: Nettsøk bruker DuckDuckGo uten API-nøkkel.
sv: Webbsökning använder DuckDuckGo utan API-nyckel.

source: When the model should use this skill
da: Hvornår modellen skal bruge denne færdighed
es: Cuándo debe usar el modelo esta habilidad
nb: Når modellen bør bruke denne ferdigheten
sv: När modellen ska använda den här färdigheten

source: Working directory
da: Arbejdsmappe
es: Directorio de trabajo
nb: Arbeidsmappe
sv: Arbetskatalog

source: Working…
da: Arbejder…
es: Procesando…
nb: Arbeider…
sv: Arbetar…

source: Your message is %@ tokens — larger than this provider's %@-token window. Save it as a RAG document instead (coming soon).
da: Din besked er %@ tokens — større end denne udbyders vindue på %@ tokens. Gem den som et RAG-dokument i stedet (kommer snart).
es: Tu mensaje tiene %@ tokens, más que la ventana de %@ tokens de este proveedor. Guárdalo como documento RAG (próximamente).
nb: Meldingen din er på %@ tokener — større enn leverandørens vindu på %@ tokener. Lagre den som et RAG-dokument i stedet (kommer snart).
sv: Ditt meddelande är %@ tokens — större än denna leverantörs %@-token-fönster. Spara det som ett RAG-dokument istället (kommer snart).

source: auto-discover from MCP server
da: find automatisk fra MCP-server
es: detectar automáticamente desde el servidor MCP
nb: auto-oppdag fra MCP-server
sv: automatisk identifiering från MCP-server

source: blank to auto-register
da: tom for automatisk registrering
es: en blanco para registrar automáticamente
nb: tomt for auto-registrering
sv: lämna tom för auto-registrering

source: comma-separated
da: kommaseparerede
es: separados por comas
nb: kommaseparert
sv: kommaseparerade

source: comma-separated · e.g. END,<|stop|>
da: kommaseparerede · f.eks. END,<|stop|>
es: separados por comas · p. ej., END,<|stop|>
nb: kommaseparert · f.eks. END,<|stop|>
sv: kommaseparerade · t.ex. END,<|stop|>

source: lowercase-with-hyphens
da: småbogstaver-med-bindestreg
es: minúsculas-con-guiones
nb: småbokstaver-med-bindestrek
sv: gemener-med-bindestreck

# migration.sheet.dismiss
source: Dismiss
da: Luk
es: Descartar
nb: Lukk
sv: Stäng

# migration.sheet.intro
source: Some changes were made during this update:
da: Der blev foretaget nogle ændringer under denne opdatering:
es: Se realizaron algunos cambios durante esta actualización:
nb: Noen endringer ble gjort under denne oppdateringen:
sv: Några ändringar gjordes under den här uppdateringen:

# migration.sheet.title
source: FyxLocal was updated
da: FyxLocal er blevet opdateret
es: FyxLocal se ha actualizado
nb: FyxLocal ble oppdatert
sv: FyxLocal har uppdaterats

# migration.v5.tcc.body
source: Calendar, Reminders, Contacts and Maps were disabled because this update changed the app's identity, and macOS requires you to grant permission again. Re-enable them in Settings → Tools when you want them, and approve the macOS prompt.
da: Kalender, Påmindelser, Kontakter og Kort blev deaktiveret, fordi denne opdatering ændrede appens identitet, og macOS kræver, at du giver tilladelse igen. Aktivér dem igen i Indstillinger → Værktøjer, når du vil bruge dem, og godkend macOS-dialogen.
es: Se desactivaron Calendario, Recordatorios, Contactos y Mapas porque esta actualización cambió la identidad de la app, y macOS requiere que vuelvas a concederles permiso. Vuelve a activarlos en Ajustes → Herramientas cuando los necesites y acepta la solicitud de macOS.
nb: Kalender, Påminnelser, Kontakter og Kart ble deaktivert fordi denne oppdateringen endret appens identitet, og macOS krever at du gir tillatelse på nytt. Aktiver dem igjen i Innstillinger → Verktøy når du vil bruke dem, og godkjenn macOS-forespørselen.
sv: Kalender, Påminnelser, Kontakter och Kartor inaktiverades eftersom den här uppdateringen ändrade appens identitet, och macOS kräver att du ger åtkomst igen. Aktivera dem igen i Inställningar → Verktyg när du vill ha dem, och godkänn macOS-dialogen.

# migration.v5.tcc.title
source: Apple tools were turned off
da: Apple-værktøjer blev slået fra
es: Se desactivaron las herramientas de Apple
nb: Apple-verktøy ble slått av
sv: Apple-verktyg stängdes av

# migration.v6.localnetwork.body
source: Because this update changed the app's identity, macOS will ask again for permission to find devices on your local network the next time FyxLocal connects to a locally-hosted model or MCP server. Click Allow when prompted.
da: Fordi denne opdatering ændrede appens identitet, vil macOS igen bede om tilladelse til at finde enheder på dit lokale netværk, næste gang FyxLocal opretter forbindelse til en lokalt hostet model eller MCP-server. Klik på Tillad, når du bliver spurgt.
es: Como esta actualización cambió la identidad de la app, macOS volverá a solicitar permiso para encontrar dispositivos en tu red local la próxima vez que FyxLocal se conecte a un modelo alojado localmente o a un servidor MCP. Haz clic en Permitir cuando se te solicite.
nb: Fordi denne oppdateringen endret appens identitet, vil macOS spørre på nytt om tillatelse til å finne enheter på lokalnettet neste gang FyxLocal kobler til en lokalt kjørende modell eller MCP-server. Klikk Tillat når du blir spurt.
sv: Eftersom den här uppdateringen ändrade appens identitet kommer macOS att be om tillåtelse igen att hitta enheter i ditt lokala nätverk nästa gång FyxLocal ansluter till en lokalt körd modell eller MCP-server. Klicka på Tillåt när du tillfrågas.

# migration.v6.localnetwork.title
source: Local network access needs re-approving
da: Adgang til lokalt netværk skal godkendes igen
es: El acceso a la red local necesita volver a aprobarse
nb: Lokalnettverkstilgang må godkjennes på nytt
sv: Lokal nätverksåtkomst behöver godkännas igen

source: optional
da: valgfrit
es: opcional
nb: valgfritt
sv: valfritt

source: p.%lld
da: s.%lld
nb: s.%lld
sv: s.%lld

source: paste token
da: indsæt token
es: pegar token
nb: lim inn token
sv: klistra in token

source: server default
da: serverstandard
es: predeterminado del servidor
nb: serverstandard
sv: serverstandard

source: server max: %@
da: servermaks: %@
es: máx. del servidor: %@
nb: servermaks: %@

source: space-separated
da: mellemrumsseparerede
es: separado por espacios
nb: mellomromseparert
sv: mellanslagsseparerade

source: you@example.com
da: dig@eksempel.dk
nb: deg@eksempel.no
sv: du@exempel.se

source: — pick a default —
da: — vælg en standard —
es: — elige un valor predeterminado —
nb: — velg en standard —
sv: — välj en standard —

source: •••••••• (saved in Keychain)
da: •••••••• (gemt i nøglering)
es: •••••••• (guardado en el Llavero)
nb: •••••••• (lagret i nøkkelringen)
sv: •••••••• (sparad i nyckelringen)

source: API token
es: Token de API

source: API token (Basic, email + token)
es: Token de API (Basic, correo electrónico + token)
nb: API-token (Basic, e-post + token)
sv: API-token (Basic, e-post + token)

source: API token (Bearer)
es: Token de API (Bearer)

source: API type
es: Tipo de API
sv: API-typ

source: Agent
es: Agente

source: Email
es: Correo electrónico
nb: E-post
sv: E-post

source: Format
es: Formato

source: Model
es: Modelo
nb: Modell
sv: Modell

source: OK
es: Aceptar

source: Sampling
es: Muestreo

source: Seed
es: Semilla
sv: Frö (seed)

source: System prompt
es: Prompt del sistema
nb: Systemledetekst

source: Transport
es: Transporte

source: Version
es: Versión
nb: Versjon

source: Version %@
es: Versión %@
nb: Versjon %@

source: budget
es: presupuesto
nb: budsjett

source: Web
nb: Nett
sv: Webb
